<?php
// +----------------------------------------------------------------------
// | 支付监听配置，一个文件，一个账号
// +----------------------------------------------------------------------
return [
    // 用户账号配置
    'user' => [
        'pid'       =>  1001,
        'key'       =>  '953c4d682d9ab148277b76a06e215ce7'
    ],
    // 收款平台账号配置
    'pay' => [
        // 账号id
        'aid'       =>  1,
        // 收款平台
        'platform'  =>  'sqbpay',
        // 收款平台
        'payclass'  =>  'ShouQianBa',
        // 账号
        'account'   =>  '18872410423',
        // 密码
        'password'  =>  '7698177hcnSQB',
        // 订单查询参数配置
        'query'     =>  array (
  'date_end' => NULL,
  'date_start' => NULL,
  'page' => 1,
  'page_size' => 10,
  'upayQueryType' => 0,
  'status' => '2000',
  'store_sn' => '',
  'type' => '30',
),
    ]
];
